Repository: mybot-organization/mybot
Catalog: resources/locale/*/LC_MESSAGES/mybot.po
Languages: fr

source: slash command
fr: commande slash

source: message context
fr: contexte de message

source: user context
fr: contexte d'utilisateur

source: miscellaneous
fr: divers

source: help
fr: aide

source: Get help about the bot.
fr: Obtenir de l'aide à propos du bot.

source: feature
fr: fonctionnalité

source: Commands of MyBot
fr: Commandes de MyBot

source: Slash commands
fr: Commandes slash

source: Context commands
fr: Commandes contextuelles

source: Miscellaneous features
fr: Fonctionnalités diverses

source: Help about {} [{}]
fr: Aide à propos de {} [{}]

source: Get the bot latency.
fr: Obtenir la latence du bot.

source: Get some stats about the bot.
fr: Obtenez quelques statistiques sur le bot.

source: calculator
fr: calculatrice

source: Show a calculator you can use.
fr: Afficher une calculatrice que vous pouvez utiliser.

source: Invalid expression
fr: Expression invalide

source: Delete multiple messages with filters.
fr: Supprimer plusieurs messages avec des filtres.

source: messages from the user {{}}
fr: messages de l'utilisateur {{}}

source: messages whose user has the role {{}}
fr: messages dont l'utilisateur a le rôle {{}}

source: messages that match {{}} (regex, multiline, case sensitive, not anchored)
fr: messages qui correspondent à {{}} (regex, multiligne, sensible à la casse, non ancré)

source: messages that has {{}}
fr: messages qui possèdent {{}}

source: messages longer or equal to {{}} (blank spaces included) (empty messages included)
fr: messages plus longs ou égaux à {{}} (espaces vides inclus) (messages vides inclus)

source: messages shorter or equal to {{}} (blank spaces included)
fr: messages courts ou égaux à {{}} (espaces vides inclus)

source: messages sent before {{}} (yyyy-mm-dd or message ID)
fr: messages envoyés avant {{}} (aaaa-mm-jj ou ID du message)

source: messages sent after {{}} (yyyy-mm-dd or message ID)
fr: messages envoyés après {{}} (aaaa-mm-jj ou ID du message)

source: only pinned message or exclude them from the deletion. (default to exclude)
fr: seulement le message épinglé ou les exclure de la suppression (exclus par défaut)

source: amount
fr: quantitée

source: user
fr: utilisateur

source: role
fr: rôle

source: search
fr: recherche

source: has
fr: contient

source: max_length
fr: longueur_max

source: min_length
fr: longueur_min

source: before
fr: avant

source: after
fr: après

source: pinned
fr: épinglés

source: You must supply a number between 1 and 250. (0 < {amount} < 251)
fr: Vous devez fournir un nombre entre 1 et 250. (0 < {amount} < 251)

source: Clearing {amount} message(s)...
fr: Suppression de {amount} message(s)...

source: Analyzed: {analyzed} Deleted: {deleted}/{goal} Planned for deletion: {planned}
fr: Analysés : {analyzed} Supprimés : {deleted}/{goal} Prévu pour la suppression : {planned}

source: Cannot clear more than 3 minutes. {} message(s) deleted.
fr: Impossible de supprimer plus de 3 minutes. {} message(s) supprimé(s).

source: Clear cancelled. {} message(s) deleted.
fr: Suppression annulée. {} message(s) supprimé(s).

source: {} message(s) deleted.
fr: {} message(s) supprimé(s).

source: Cancel
fr: Annuler

source: include
fr: inclus

source: exclude
fr: exclus

source: only
fr: seulement

source: video
fr: vidéo

source: stickers
fr: autocollants

source: file
fr: fichier

source: link (any URL)
fr: lien (n'importe quelle URL)

source: discord invitation
fr: invitation discord

source: config
fr: configuration

source: Set configurations.
fr: Définir des configurations.

source: guild
fr: serveur

source: Set configuration for the guild.
fr: Définir la configuration du serveur.

source: Set configuration for the bot.
fr: Définir la configuration du bot.

source: emote
fr: emoji

source: Add restriction to an emote for a role.
fr: Ajouter une restriction à un émoji pour un rôle.

source: public_translations
fr: traductions_publique

source: Set if the translations are visible for everyone or not.
fr: Définir si les traductions sont visibles par tous ou non.

source: Translations will now be public.
fr: Les traductions seront désormais publiques.

source: Translations will now be private.
fr: Les traductions seront désormais privées.

source: game
fr: jeu

source: Play some games.
fr: Jouez à des jeux.

source: connect4
fr: puissance4

source: Play connect 4
fr: Jouer au puissance 4

source: rpc
fr: pcc

source: Play rock paper scissors
fr: Jouer à Pierre Feuille Ciseaux

source: tictactoe
fr: morpion

source: Play tictactoe
fr: Jouer au morpion

source: minesweeper
fr: démineur

source: Play minesweeper
fr: Jouer au démineur

source: Play 2048
fr: Jouer au 2048

source: poll
fr: sondage

source: Create a new poll
fr: Créer un nouveau sondage

source: Edit poll
fr: Modifier un sondage

source: Use this to edit a poll even after creation.
fr: Utilisez ceci pour modifier un sondage même après sa création.

source: custom_choice
fr: choix_customisable

source: A poll with customizable options.
fr: Un sondage avec des options personnalisables.

source: yesno
fr: oui_non

source: A simple poll with "Yes" and "No" as options.
fr: Un simple sondage avec "Oui" et "Non" comme options.

source: This message is not a poll.
fr: Ce message n'est pas un sondage.

source: You are not the author of this poll. You can't edit it.
fr: Vous n'êtes pas le créateur du sondage. Vous ne pouvez pas le modifier.

source: Poll question
fr: Question du sondage

source: Do you agree this bot is awesome?
fr: Êtes-vous d'accord que ce bot est génial ?

source: Poll description
fr: Description du sondage

source: Tell more about your poll here.
fr: Dites-en plus à propos de votre sondage ici.

source: Choice 1
fr: Choix 1

source: Yes, totally!
fr: Oui, totalement !

source: Choice 2
fr: Choix 2

source: Absolutely!
fr: Absolument !

source: Choice 3
fr: Choix 3

source: Of course!
fr: Bien sûr !

source: Poll created by {}
fr: Sondage créé par {}

source: Poll closed.
fr: Sondage fermé.

source: No end date.
fr: Pas de date de fin.

source: Poll ends <t:{}:R>
fr: Le sondage se termine <t:{}:R>

source: Yes!
fr: Oui !

source: No!
fr: Non !

source: Reset
fr: Réinitialiser

source: Save
fr: Sauvegarder

source: Reopen poll
fr: Réouvrir le sondage

source: Close poll
fr: Fermer le sondage

source: The poll has been updated while you were voting.
fr: Le sondage a été mis à jour pendant votre vote.

source: Edit title and description
fr: Modifier le titre et la description

source: Edit ending time
fr: Modifier l'heure de fin

source: Select the number of days.
fr: Saisissez le nombre de jours.

source: Select the number of hours.
fr: Sélectionnez le nombre d'heures.

source: Select the number of minutes.
fr: Sélectionnez le nombre de minutes.

source: {} day(s)
fr: {} jour(s)

source: {} hour(s)
fr: {} heure(s)

source: Edit choices
fr: Modifier les choix

source: Add a choice
fr: Ajouter un choix

source: Remove a choice
fr: Retirer un choix

source: Add a new choice
fr: Ajouter un nouveau choix

source: Choice
fr: Choix

source: Enter a new choice here.
fr: Saisissez un nouveau choix ici.

source: Select the choices you want to remove.
fr: Sélectionnez les choix que vous souhaitez retirer.

source: Edit max choices
fr: Modifier le maximum de choix

source: Select the maximum number of choices.
fr: Sélectionnez le nombre maximum de choix.

source: Edit allowed roles
fr: Modifier les rôles autorisés

source: Select the roles that can vote.
fr: Sélectionnez les rôles qui peuvent voter.

source: This operation cannot be undone. By clicking on the "RESET" button, all the votes will be deleted.
fr: Cette opération ne peut pas être annulée. En cliquant sur le bouton "RÉINITIALISER", tous les votes seront supprimés.

source: Vote
fr: Voter

source: Sorry, this poll seems not to exist. Please contact an admin.
fr: Désolé, ce sondage ne semble pas exister. Veuillez contacter un administrateur.

source: Sorry, this poll is closed, you can't vote anymore!
fr: Désolé, ce sondage est fermé, vous ne pouvez plus voter !

source: Sorry, this poll is over, you can't vote anymore!
fr: Désolé, ce sondage est terminé, vous ne pouvez plus voter !

source: Sorry, you need one of the following roles to vote :
fr: Désolé, vous avez besoin de l'un des rôles suivants pour voter :

source: Remove vote
fr: Retirer le vote

source: Validate
fr: Valider

source: Your vote has been removed.
fr: Votre vote a été retiré.

source: Your vote has been taken into account!
fr: Votre vote a été pris en compte !

source: Yes
fr: Oui

source: No
fr: Non

source: Translate
fr: Traduire

source: Translate a message with your account language settings.
fr: Traduisez un message dans la langue de votre compte.

source: translate
fr: traduire

source: Translate text in a selection of languages.
fr: Traduire le texte dans une sélection de langues.

source: The language you provided is not supported.
fr: La langue que vous avez fournie n'est pas prise en charge.

source: Translate text in the language corresponding on the flag you add.
fr: Traduire le texte dans la langue correspondant au drapeau que vous ajoutez.

source: The language you asked for is not supported.
fr: La langue demandée n'est pas prise en charge.

source: Your locale is not supported.
fr: Votre langue n'est pas prise en charge.

source: Vote for the bot
fr: Votez pour le bot

source: You have reached the maximum number of translations per day.Vote for the bot to remove this limit !
fr: Vous avez atteint le nombre maximum de traduction par jour. Votez pour le bot pour retirer cette limite !

source: Translate from {from_} to {to}
fr: Traduire depuis {from_} vers {to}

source: Support server
fr: Serveur support

source: This command is already executed the max amount of times. (Max: {error.rate})
fr: Cette commande est déjà exécutée le nombre maximal de fois. (Max : {error.rate})

source: The bot is missing some permissions. `{}`
fr: Il manque des permissions au bot. `{}`

source: You provided a bad argument.
fr: Vous avez fourni un mauvais argument.

source: It looks like the bot has been added incorrectly. Please ask an admin to re-add the bot.
fr: Il semblerait que le bot ait été ajouté de manière incorrecte. Veuillez demander à un administrateur de ré-ajouter le bot.

source: This command cannot be used in DMs.
fr: Cette commande ne peut pas être utilisée en message privé.

source: An unhandled error happened. Please ask on the support server!
fr: Une erreur inattendue est survenue. Demandez de l'aide sur le serveur de support !
